VEDA4-T4/logistics-automation/stm32/gripper-controller/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ESTOP_TEST_BUTTON_Pin GPIO_PIN_13
#define ESTOP_TEST_BUTTON_GPIO_Port GPIOC
#define ESTOP_TEST_BUTTON_EXTI_IRQn EXTI15_10_IRQn
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define SERVO_BASE_PWM_Pin GPIO_PIN_6
#define SERVO_BASE_PWM_GPIO_Port GPIOA
#define SERVO_SHOULDER_PWM_Pin GPIO_PIN_7
#define SERVO_SHOULDER_PWM_GPIO_Port GPIOA
#define SERVO_ELBOW_PWM_Pin GPIO_PIN_0
#define SERVO_ELBOW_PWM_GPIO_Port GPIOB
#define SERVO_GRIP_PWM_Pin GPIO_PIN_1
#define SERVO_GRIP_PWM_GPIO_Port GPIOB
#define GRIPPER_UART_TX_Pin GPIO_PIN_9
#define GRIPPER_UART_TX_GPIO_Port GPIOA
#define GRIPPER_UART_RX_Pin GPIO_PIN_10
#define GRIPPER_UART_RX_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
